[
    {
        "title": "Primeira Aula: Introdução à Ciência da Computação",
        "date": "2025-02-12",
        "content": "<div class='space-y-4'><p class='font-bold text-xl mb-4'>Nossa Jornada Começa Aqui!</p><p>Hoje tivemos nossa primeira aula com a Profa. Dra. Kadidja Valéria, uma profissional que traz consigo uma bagagem impressionante na área de tecnologia e educação. Com doutorado em andamento em Ciência da Informação pela UnB, ela nos apresentou uma visão ampla e inspiradora do que nos espera nessa jornada.</p><h3 class='font-bold text-lg mt-6 mb-2'>O que é Ciência da Computação?</h3><p>A Ciência da Computação é muito mais do que apenas programação. É uma área que estuda:</p><ul class='list-disc pl-6 mb-4'><li>Como resolver problemas usando computadores</li><li>Como processar e armazenar informações de forma eficiente</li><li>Como criar sistemas que impactam positivamente a sociedade</li><li>Como desenvolver novas tecnologias e inovações</li></ul><h3 class='font-bold text-lg mt-6 mb-2'>Mercado de Trabalho em TI</h3><p>O mercado de TI está em constante expansão, com diversas áreas de atuação:</p><ul class='list-disc pl-6 mb-4'><li><strong>Desenvolvimento de Software:</strong> Criação de aplicativos, sistemas e websites</li><li><strong>Ciência de Dados:</strong> Análise e processamento de grandes volumes de dados</li><li><strong>Inteligência Artificial:</strong> Desenvolvimento de sistemas inteligentes e automação</li><li><strong>Segurança da Informação:</strong> Proteção de sistemas e dados</li><li><strong>Arquitetura de Sistemas:</strong> Planejamento e estruturação de soluções tecnológicas</li></ul><h3 class='font-bold text-lg mt-6 mb-2'>Dicas para Calouros</h3><ul class='list-disc pl-6 mb-4'><li><strong>Mantenha-se Curioso:</strong> A tecnologia evolui rapidamente, esteja sempre aprendendo</li><li><strong>Pratique Muito:</strong> Programação é como um instrumento musical, requer prática constante</li><li><strong>Trabalhe em Projetos:</strong> Crie um portfólio com seus projetos pessoais</li><li><strong>Networking:</strong> Participe de eventos, comunidades e grupos de estudo</li><li><strong>Inglês é Fundamental:</strong> Grande parte do material e documentação está em inglês</li></ul><h3 class='font-bold text-lg mt-6 mb-2'>Próximos Passos</h3><p>Nas próximas aulas, vamos mergulhar em conceitos fundamentais como:</p><ul class='list-disc pl-6 mb-4'><li>História da Computação</li><li>Sistemas Numéricos</li><li>Lógica de Programação</li><li>Algoritmos Básicos</li></ul></div>",
        "tags": ["primeira aula", "introdução", "carreira em TI", "mercado de trabalho", "dicas para calouros"]
    }
]